000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКонсьюмеры/КафкаКонсьюмеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаКонсьюмеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДвоичныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьДесериализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпотокиТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДесериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетодаДесериализации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМодуляДесериализации</name>
      <comment>Менеджер обмена (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПОДДесериализации</name>
      <comment>Имя ПОД (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматДесериализации</name>
      <comment>Формат (КД 3.1)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыКонсьюмера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаБрокеры/КафкаБрокеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаБрокеры</name>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПодключения</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимПароля</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКонсьюмеры/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание консьюмера.
// 
// Параметры:
//  Консьюмер - СправочникСсылка.КафкаКонсьюмеры - Консьюмер
// 
// Возвращаемое значение:
//	см. НовоеОписаниеКонсьюмера
Функция ОписаниеКонсьюмера(Консьюмер) Экспорт
	
	Результат = НовоеОписаниеКонсьюмера();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Консьюмеры.Ссылка,
	|	Консьюмеры.Наименование,
	|	Консьюмеры.Брокер,
	|	Консьюмеры.Идентификатор,
	|	Консьюмеры.ТаймаутОжидания,
	|	Консьюмеры.ДвоичныеДанные
	|ИЗ
	|	Справочник.КафкаКонсьюмеры КАК Консьюмеры
	|ГДЕ
	|	Консьюмеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсьюмерыТопики.Топик
	|ИЗ
	|	Справочник.КафкаКонсьюмеры.Топики КАК КонсьюмерыТопики
	|ГДЕ
	|	КонсьюмерыТопики.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсьюмерыПараметры.Ключ,
	|	КонсьюмерыПараметры.Значение
	|ИЗ
	|	Справочник.КафкаКонсьюмеры.ПараметрыКонсьюмера КАК КонсьюмерыПараметры
	|ГДЕ
	|	КонсьюмерыПараметры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Консьюмер);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Топики = РезультатЗапроса[1];
	ВыборкаПараметры = РезультатЗапроса[2].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступныеБрокеры = Справочники.КафкаБрокеры.ДоступныеБрокеры();
		Брокер = ДоступныеБрокеры.Получить(Выборка.Брокер);
		Если Брокер = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗаполнитьЗначенияСвойств(Результат, Брокер, "АдресБрокера,ПараметрыПодключения");
		
		Результат.Топики = Топики.Выгрузить().ВыгрузитьКолонку(0);
		
		Пока ВыборкаПараметры.Следующий() Цикл
			Результат.ПараметрыПодключения.Вставить(ВыборкаПараметры.Ключ, ВыборкаПараметры.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Возвращает правила десериализации для указанных консьюмеров.
//
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.КафкаКонсьюмеры - список ссылок на консьюмеров
//
// Возвращаемое значение:
//	Соответствие Из Строка - словарь десериализации:
//	 * Ключ - Строка - Продюсер + ТипОбъект
//	 * Значение - Структура - Описание десериализации, см. кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена
Функция ПравилаДесериализации(Консьюмеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкКонсьюмерыТопики.Ссылка КАК Ссылка,
	|	кфкКонсьюмерыТопики.Топик КАК Топик,
	|	кфкКонсьюмерыТопики.ТипДесериализации КАК Тип,
	|	кфкКонсьюмерыТопики.ИмяМетодаДесериализации КАК ИмяМетода,
	|	кфкКонсьюмерыТопики.ИмяМодуляДесериализации КАК ИмяМодуля,
	|	кфкКонсьюмерыТопики.ИмяПОДДесериализации КАК ИмяПОД,
	|	кфкКонсьюмерыТопики.ФорматДесериализации КАК Формат
	|ИЗ
	|	Справочник.КафкаКонсьюмеры.Топики КАК кфкКонсьюмерыТопики
	|ГДЕ
	|	кфкКонсьюмерыТопики.Ссылка В (&Консьюмеры)";
	Запрос.УстановитьПараметр("Консьюмеры", Консьюмеры);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
//		
//		Описание = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
//		ЗаполнитьЗначенияСвойств(Описание, Выборка);
//		
//		// TODO: КД - Обратная совместимость
//		Если Описание.Тип.Пустая() И Не ПустаяСтрока(Описание.ИмяМетода)
//				И ПустаяСтрока(Описание.ИмяМодуля + Описание.ИмяПОД + Описание.Формат) Тогда
//			Описание.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
//		КонецЕсли;
//		
//		Результат.Вставить(НРег(XMLСтрока(Выборка.Ссылка) + Выборка.Топик), Описание);
//		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Точки получения сообщений.
// 
// Параметры:
//	Консьюмеры - Массив Из СправочникСсылка.КафкаКонсьюмеры - Консьюмеры
// 
// Возвращаемое значение:
//	Соответствие Из КлючИЗначение - Точки получения сообщений:
//	 * Ключ - СправочникСсылка.КафкаКонсьюмеры - Идентификатор консьюмера
//	 * Значение - Структура - Точка получения сообщений:
//		** АдресБрокера - Строка - Адрес брокера
//		** Идентификатор - Строка - Идентификатор группы консьюмера
//		** Топики - Массив Из Строка - Топики консьюмера
Функция ТочкиПолученияСообщений(Консьюмеры) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Консьюмеры.Ссылка КАК Ссылка,
	|	Консьюмеры.Брокер КАК Брокер,
	|	Консьюмеры.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.КафкаКонсьюмеры КАК Консьюмеры
	|ГДЕ
	|	Консьюмеры.Ссылка В (&Консьюмеры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсьюмерыТопики.Ссылка КАК Ссылка,
	|	КонсьюмерыТопики.Топик КАК Топик
	|ИЗ
	|	Справочник.КафкаКонсьюмеры.Топики КАК КонсьюмерыТопики
	|ГДЕ
	|	КонсьюмерыТопики.Ссылка В (&Консьюмеры)
	|ИТОГИ
	|ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Консьюмеры", Консьюмеры);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаТопики = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДоступныеБрокеры = Справочники.КафкаБрокеры.ДоступныеБрокеры();
	
	// АдресБрокера, Идентификатор
	Пока Выборка.Следующий() Цикл
		
		Брокер = ДоступныеБрокеры.Получить(Выборка.Брокер);
		Если Брокер = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Описание = Новый Структура;
		Описание.Вставить("АдресБрокера", Брокер.АдресБрокера);
		Описание.Вставить("Идентификатор", Выборка.Идентификатор);
		Описание.Вставить("Топики", Новый Массив);
		
		Результат.Вставить(Выборка.Ссылка, Описание);
		
	КонецЦикла;
	
	Пока ВыборкаТопики.Следующий() Цикл
		
		Описание = Результат.Получить(ВыборкаТопики.Ссылка);
		Если Описание = Неопределено Тогда
			Продолжить
		КонецЕсли;
		
		Описание.Топики = ОбщегоНазначения.ВыбратьКолонку(ВыборкаТопики.Выбрать(), "Топик");
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новое описание консьюмера.
// 
// Возвращаемое значение:
//	Структура - описание консьюмера:
//	 * Ссылка - СправочникСсылка.КафкаКонсьюмеры - Консьюмер 
//	 * Наименование - Строка - Наименование консьюмера
//	 * АдресБрокера - Строка - Адрес брокера
//	 * Идентификатор - Строка - Идентификатор группы
//	 * ТаймаутОжидания - Число - Таймаут ожидания сообщений
//	 * ДвоичныеДанные - Булево - Получать сообщения двоичными данными
//	 * Топики - Массив Из Строка - Топики
//	 * ПараметрыПодключения - Соответствие Из КлючИЗначение - Параметры подключения брокера и консьюмера:
//		** Ключ - Строка - Имя параметра
//		** Значение - Строка - Значение параметра
Функция НовоеОписаниеКонсьюмера()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("Наименование", "");
	Результат.Вставить("АдресБрокера", "");
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ТаймаутОжидания", 0);
	Результат.Вставить("ДвоичныеДанные", Ложь);
	Результат.Вставить("Топики", Новый Массив);
	Результат.Вставить("ПараметрыПодключения", Новый Соответствие);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#КонецЕсли
